[
    {
        "id": 1,
        "category": "Tech",
        "isLatest": true,
        "title": "Sarvam AI launches 30B and 105B open-source LLM models",
        "title_hi": "Sarvam AI ने 30B और 105B ओपन-सोर्स LLM मॉडल लॉन्च किए",
        "imageUrl": "https://images.unsplash.com/photo-1677442136019-21780ecad995?auto=format&fit=crop&q=80&w=800",
        "location": "New Delhi",
        "sourceName": "Business Today",
        "sourceUrl": "https://www.businesstoday.in/",
        "shortDescription": "Indian AI startup Sarvam AI releases large open-source language models tailored for Indian languages.",
        "shortDescription_hi": "भारतीय एआई स्टार्टअप सरवम एआई ने भारतीय भाषाओं के लिए तैयार बड़े ओपन-सोर्स भाषा मॉडल जारी किए।",
        "fullContent": "Sarvam AI has announced the release of its latest large language models (LLMs), featuring 30-billion and 105-billion parameter architectures optimized for Indian languages.",
        "fullContent_hi": "सरवम एआई ने अपने नवीनतम बड़े भाषा मॉडल जारी करने की घोषणा की है।"
    },
    {
        "id": 2,
        "category": "Business",
        "isLatest": true,
        "title": "Adani Pledges $100 billion for Data Infrastructure in India",
        "title_hi": "अडानी ने भारत में डेटा इंफ्रास्ट्रक्चर के लिए $100 बिलियन का संकल्प लिया",
        "imageUrl": "https://images.unsplash.com/photo-1451187580459-43490279c0fa?auto=format&fit=crop&q=80&w=800",
        "location": "Ahmedabad",
        "sourceName": "Economic Times",
        "sourceUrl": "https://economictimes.indiatimes.com/",
        "shortDescription": "Gautam Adani triples down on digital infrastructure to support India's AI processing needs.",
        "shortDescription_hi": "गौतम अडानी ने भारत की एआई प्रोसेसिंग जरूरतों के लिए डिजिटल बुनियादी ढांचे पर निवेश तीन गुना किया।",
        "fullContent": "Adani Group has pledged a massive $100 billion investment over the next decade to build data centers and digital infrastructure.",
        "fullContent_hi": "अडानी समूह ने अगले दशक में डेटा सेंटर निर्माण के लिए $100 बिलियन के निवेश का संकल्प लिया है।"
    },
    {
        "id": 3,
        "category": "Tech",
        "title": "Google announces I/O 2026 dates as Sundar Pichai lands in India",
        "title_hi": "सुंदर पिचाई के भारत आगमन पर गूगल ने I/O 2026 की घोषणा की",
        "imageUrl": "https://images.unsplash.com/photo-1544197150-b99a580bb7a8?auto=format&fit=crop&q=80&w=800",
        "location": "New Delhi",
        "sourceName": "Livemint",
        "sourceUrl": "https://www.livemint.com/",
        "shortDescription": "Sundar Pichai announces strategic AI partnerships and the dates for Google's annual developer conference.",
        "shortDescription_hi": "सुंदर पिचाई ने रणनीतिक एआई साझेदारी और गूगल के वार्षिक डेवलपर सम्मेलन की तारीखों की घोषणा की।",
        "fullContent": "During a high-profile visit to India, Google CEO Sundar Pichai revealed that Google I/O 2026 will take place in May.",
        "fullContent_hi": "भारत की यात्रा के दौरान, गूगल के सीईओ सुंदर पिचाई ने खुलासा किया कि गूगल आई/ओ 2026 मई में होगा।"
    },
    {
        "id": 4,
        "category": "Stock",
        "isLatest": true,
        "title": "Nifty 50 approaches 25,000 mark amid global rally",
        "title_hi": "वैश्विक तेजी के बीच निफ्टी 50 25,000 के स्तर के करीब",
        "imageUrl": "https://images.unsplash.com/photo-1611974717482-98ea23366c89?auto=format&fit=crop&q=80&w=800",
        "location": "Mumbai",
        "sourceName": "Moneycontrol",
        "sourceUrl": "https://www.moneycontrol.com/",
        "shortDescription": "Indian markets hit record highs as foreign institutional investors turn net buyers.",
        "shortDescription_hi": "विदेशी संस्थागत निवेशकों के शुद्ध खरीदार बनने से भारतीय बाजारों ने रिकॉर्ड ऊंचाई को छुआ।",
        "fullContent": "The Nifty 50 index gained 1.2% to close at 24,950, led by heavyweights in the banking and IT sectors.",
        "fullContent_hi": "बैंकिंग और सूचना प्रौद्योगिकी क्षेत्रों के नेतृत्व में निफ्टी 50 सूचकांक 1.2% बढ़कर 24,950 पर बंद हुआ।"
    },
    {
        "id": 5,
        "category": "Stock",
        "title": "Zomato shares surge 5% on strong quarterly outlook",
        "title_hi": "मजबूत तिमाही दृष्टिकोण पर जोमैटो के शेयर 5% उछले",
        "imageUrl": "https://images.unsplash.com/photo-1590283603385-17ffb3a7f29f?auto=format&fit=crop&q=80&w=800",
        "location": "Gurugram",
        "sourceName": "Economic Times",
        "sourceUrl": "https://economictimes.indiatimes.com/",
        "shortDescription": "Analysts remain bullish on the food delivery giant as profitability stabilizes.",
        "shortDescription_hi": "खाद्य वितरण दिग्गज पर विश्लेषक उत्साहित बने हुए हैं क्योंकि लाभप्रदता स्थिर हो गई है।",
        "fullContent": "Zomato Ltd saw intense buying pressure after several brokerages upgraded their price targets following a robust performance.",
        "fullContent_hi": "मजबूत प्रदर्शन के बाद कई ब्रोकरेज द्वारा अपने मूल्य लक्ष्यों को बढ़ाने के बाद जोमैटो में तीव्र खरीदारी का दबाव देखा गया।"
    },
    {
        "id": 6,
        "category": "Economy",
        "isLatest": true,
        "title": "RBI holds repo rate at 6.5% amid global uncertainty",
        "title_hi": "वैश्विक अनिश्चितता के बीच RBI ने रेपो दर 6.5% पर स्थिर रखी",
        "imageUrl": "https://images.unsplash.com/photo-1611974789855-9c2a0a7236a3?auto=format&fit=crop&q=80&w=800",
        "location": "Mumbai",
        "sourceName": "Economic Times",
        "sourceUrl": "https://economictimes.indiatimes.com/",
        "shortDescription": "The Reserve Bank of India's Monetary Policy Committee voted to maintain the benchmark interest rate citing inflation concerns.",
        "shortDescription_hi": "भारतीय रिज़र्व बैंक की मौद्रिक नीति समिति ने मुद्रास्फीति की चिंताओं का हवाला देते हुए बेंचमार्क ब्याज दर को बनाए रखने के लिए मतदान किया।",
        "fullContent": "The Reserve Bank of India kept its benchmark repo rate unchanged at 6.5% for the sixth consecutive meeting, with the MPC noting that inflation remains above the 4% target.",
        "fullContent_hi": "भारतीय रिज़र्व बैंक ने लगातार छठी बैठक में अपनी बेंचमार्क रेपो दर को 6.5% पर अपरिवर्तित रखा।"
    },
    {
        "id": 7,
        "category": "Economy",
        "title": "India's GDP growth forecast revised upward to 7.2% for FY2026",
        "title_hi": "भारत की जीडीपी वृद्धि का पूर्वानुमान FY2026 के लिए 7.2% ऊपर संशोधित",
        "imageUrl": "https://images.unsplash.com/photo-1526304640581-d334cdbbf45e?auto=format&fit=crop&q=80&w=800",
        "location": "New Delhi",
        "sourceName": "Business Standard",
        "sourceUrl": "https://www.business-standard.com/",
        "shortDescription": "IMF and World Bank both raise India's economic growth projections on strong domestic consumption and investment.",
        "shortDescription_hi": "आईएमएफ और विश्व बैंक दोनों ने मजबूत घरेलू खपत और निवेश पर भारत के आर्थिक विकास के अनुमान बढ़ाए।",
        "fullContent": "India's GDP growth forecast has been revised upward to 7.2% for the financial year 2026, making it the fastest-growing major economy in the world.",
        "fullContent_hi": "भारत की जीडीपी वृद्धि का पूर्वानुमान वित्त वर्ष 2026 के लिए 7.2% ऊपर संशोधित किया गया है।"
    },
    {
        "id": 8,
        "category": "Economy",
        "title": "India's fiscal deficit narrows to 5.1% of GDP in Q3",
        "title_hi": "तीसरी तिमाही में भारत का राजकोषीय घाटा GDP के 5.1% तक संकुचित",
        "imageUrl": "https://images.unsplash.com/photo-1543286386-713bdd548da4?auto=format&fit=crop&q=80&w=800",
        "location": "New Delhi",
        "sourceName": "Livemint",
        "sourceUrl": "https://www.livemint.com/",
        "shortDescription": "Government data shows improved fiscal management as tax revenues surge on strong GST collections.",
        "shortDescription_hi": "सरकारी आंकड़ों से बेहतर राजकोषीय प्रबंधन का पता चलता है क्योंकि जीएसटी संग्रह में वृद्धि के कारण कर राजस्व बढ़ा।",
        "fullContent": "India's fiscal deficit narrowed to 5.1% of GDP in the third quarter, driven by strong GST collections and improved direct tax revenues.",
        "fullContent_hi": "मजबूत जीएसटी संग्रह और बेहतर प्रत्यक्ष कर राजस्व के कारण भारत का राजकोषीय घाटा तीसरी तिमाही में सकल घरेलू उत्पाद के 5.1% तक सिकुड़ गया।"
    },
    {
        "id": 9,
        "category": "Geopolitics",
        "isLatest": true,
        "title": "India-China border talks resume in Ladakh amid diplomatic push",
        "title_hi": "कूटनीतिक दबाव के बीच लद्दाख में भारत-चीन सीमा वार्ता फिर शुरू",
        "imageUrl": "https://images.unsplash.com/photo-1558618666-fcd25c85cd64?auto=format&fit=crop&q=80&w=800",
        "location": "New Delhi",
        "sourceName": "The Hindu",
        "sourceUrl": "https://www.thehindu.com/",
        "shortDescription": "Senior military commanders from India and China hold fresh round of talks to resolve remaining friction points along the LAC.",
        "shortDescription_hi": "भारत और चीन के वरिष्ठ सैन्य कमांडर एलएसी के साथ शेष घर्षण बिंदुओं को हल करने के लिए वार्ता का नया दौर आयोजित करते हैं।",
        "fullContent": "India and China have resumed military-level talks in Ladakh to address remaining disengagement issues along the Line of Actual Control.",
        "fullContent_hi": "भारत और चीन ने वास्तविक नियंत्रण रेखा के साथ शेष विघटन मुद्दों को हल करने के लिए लद्दाख में सैन्य स्तरीय वार्ता फिर से शुरू की है।"
    },
    {
        "id": 10,
        "category": "Geopolitics",
        "title": "India joins G7 energy security dialogue as strategic partner",
        "title_hi": "भारत रणनीतिक साझेदार के रूप में जी7 ऊर्जा सुरक्षा वार्ता में शामिल",
        "imageUrl": "https://images.unsplash.com/photo-1529107386315-e1a2ed48a620?auto=format&fit=crop&q=80&w=800",
        "location": "New Delhi",
        "sourceName": "Indian Express",
        "sourceUrl": "https://indianexpress.com/",
        "shortDescription": "India's foreign minister participates in G7 energy talks signalling deepening ties with Western nations on critical resource security.",
        "shortDescription_hi": "भारत के विदेश मंत्री जी7 ऊर्जा वार्ता में भाग लेते हैं जो महत्वपूर्ण संसाधन सुरक्षा पर पश्चिमी देशों के साथ गहरे संबंधों का संकेत देता है।",
        "fullContent": "India has joined the G7 energy security dialogue as a strategic partner, marking a significant step in its global diplomatic outreach.",
        "fullContent_hi": "भारत एक रणनीतिक साझेदार के रूप में जी7 ऊर्जा सुरक्षा वार्ता में शामिल हुआ है।"
    },
    {
        "id": 11,
        "category": "Geopolitics",
        "title": "Russia-Ukraine ceasefire talks gain momentum with US mediation",
        "title_hi": "अमेरिकी मध्यस्थता से रूस-यूक्रेन युद्धविराम वार्ता को मिली गति",
        "imageUrl": "https://images.unsplash.com/photo-1504711434969-e33886168f5c?auto=format&fit=crop&q=80&w=800",
        "location": "Geneva",
        "sourceName": "DW English",
        "sourceUrl": "https://www.dw.com/",
        "shortDescription": "American envoys meet with representatives of both nations in Geneva as international pressure mounts for a negotiated end to the conflict.",
        "shortDescription_hi": "अमेरिकी दूत जिनेवा में दोनों देशों के प्रतिनिधियों से मिलते हैं क्योंकि संघर्ष के वार्तागत अंत के लिए अंतरराष्ट्रीय दबाव बढ़ता है।",
        "fullContent": "Ceasefire talks between Russia and Ukraine have gained new momentum as US mediators shuttle between Kyiv and Moscow with a proposed framework.",
        "fullContent_hi": "रूस और यूक्रेन के बीच युद्धविराम वार्ता ने नई गति प्राप्त की है क्योंकि अमेरिकी मध्यस्थ एक प्रस्तावित ढांचे के साथ कीव और मास्को के बीच आवाजाही कर रहे हैं।"
    },
    {
        "id": 12,
        "category": "Economy",
        "title": "India's exports cross $500 billion milestone for first time",
        "title_hi": "पहली बार भारत का निर्यात $500 बिलियन के मील के पत्थर को पार",
        "imageUrl": "https://images.unsplash.com/photo-1578575437130-527eed3abbec?auto=format&fit=crop&q=80&w=800",
        "location": "New Delhi",
        "sourceName": "Financial Express",
        "sourceUrl": "https://www.financialexpress.com/",
        "shortDescription": "India's merchandise and services exports hit a record $500 billion driven by IT services and pharmaceutical exports.",
        "shortDescription_hi": "आईटी सेवाओं और फार्मास्यूटिकल निर्यात द्वारा संचालित भारत का वस्तु और सेवा निर्यात रिकॉर्ड $500 बिलियन तक पहुंचा।",
        "fullContent": "India has crossed the $500 billion mark in total exports for the first time, driven primarily by strong performance in IT services, pharmaceuticals, and engineering goods.",
        "fullContent_hi": "भारत ने पहली बार कुल निर्यात में $500 बिलियन का आंकड़ा पार किया है।"
    }
]